rfuse/custom/ycsb_log/rr_f_load.log
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl site.ycsb:rocksdb-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
java -cp /home/ldy/YCSB/rocksdb/conf:/home/ldy/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/root/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/root/.m2/repository/org/slf4j/slf4j-api/1.7.25/slf4j-api-1.7.25.jar:/root/.m2/repository/net/jcip/jcip-annotations/1.0/jcip-annotations-1.0.jar:/root/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/root/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/root/.m2/repository/org/rocksdb/rocksdbjni/6.2.2/rocksdbjni-6.2.2.jar:/root/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/home/ldy/YCSB/core/target/core-0.18.0-SNAPSHOT.jar site.ycsb.Client -db site.ycsb.db.rocksdb.RocksDBClient -P workloads/workloadf -P db.properties -p recordcount=40000000 -load
Command line: -db site.ycsb.db.rocksdb.RocksDBClient -P workloads/workloadf -P db.properties -p recordcount=40000000 -load
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Error inserting, not retrying any more. number of attempts: 1Insertion Retry Limit: 0
[OVERALL], RunTime(ms), 718069
[OVERALL], Throughput(ops/sec), 35214.04488983649
[TOTAL_GCS_PS_Scavenge], Count, 4889
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 3114
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.43366306023515844
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 4889
[TOTAL_GC_TIME], Time(ms), 3114
[TOTAL_GC_TIME_%], Time(%), 0.43366306023515844
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1319424.0
[CLEANUP], MinLatency(us), 1318912
[CLEANUP], MaxLatency(us), 1319935
[CLEANUP], 95thPercentileLatency(us), 1319935
[CLEANUP], 99thPercentileLatency(us), 1319935
[INSERT], Operations, 25286114
[INSERT], AverageLatency(us), 27.389597745228862
[INSERT], MinLatency(us), 8
[INSERT], MaxLatency(us), 633855
[INSERT], 95thPercentileLatency(us), 26
[INSERT], 99thPercentileLatency(us), 292
[INSERT], Return=OK, 25286114
[INSERT], Return=ERROR, 1
[INSERT-FAILED], Operations, 1
[INSERT-FAILED], AverageLatency(us), 16084.0
[INSERT-FAILED], MinLatency(us), 16080
[INSERT-FAILED], MaxLatency(us), 16087
[INSERT-FAILED], 95thPercentileLatency(us), 16087
[INSERT-FAILED], 99thPercentileLatency(us), 16087